## Previewing the DataFrame

In [1]:
# Here is how to import pandas in your project
import pandas as pd;

In [2]:
df = pd.read_csv('../../titanic.csv', header=0)

In [3]:
# To get the description of the DataFrame before viewing it. You get Dtype, columns name, number of rows or entries, number of non-null rows for each column. 
data = df
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 896 entries, 0 to 895
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  896 non-null    int64
 1   Survived     896 non-null    int64
 2   Pclass       896 non-null    int64
 3   Name         896 non-null    object
 4   Sex          896 non-null    object
 5   Age          716 non-null    float64
 6   SibSp        896 non-null    int64
 7   Parch        896 non-null    int64
 8   Ticket       896 non-null    object
 9   Fare         896 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     894 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 84.1+ KB

In [4]:
# To see just the head of the dataFrame, you can use head method which will display just the first 5 row.
data = df
data.head() # By default you get the first 5 but can also specify like df.head(5), df.head(10),...

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
3,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
# To see just the tail of the dataFrame, you can use tail method which will display just the last 5 row.
data = df
data.tail() # By default you get the last 5 but can also specify like df.tail(5), df.tail(10),...

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
891,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
892,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
893,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
894,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
895,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
# To check for missing values in each column, you can run the count method. Which will return each column with number of rows that have not missing. You can then compare the c=value with the total number of rows.
data = df
data.count()

PassengerId    896
Survived       896
Pclass         896
Name           896
Sex            896
Age            716
SibSp          896
Parch          896
Ticket         896
Fare           896
Cabin          204
Embarked       894
dtype: int64

In [7]:
# To get a list of unique value of the rows of a specific column
data = df
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [8]:
# To get detail or a count of a particular column values
data = df
data['Sex'].value_counts()

Sex
male      582
female    314
Name: count, dtype: int64

In [9]:
data = df
data['Embarked'].value_counts()

Embarked
S    646
C    168
Q     80
Name: count, dtype: int64

In [10]:
# To get detail or a count of a particular column values in percentage
data = df
data['Embarked'].value_counts(normalize=True)

Embarked
S    0.722595
C    0.187919
Q    0.089485
Name: proportion, dtype: float64